# AceleraDev Codenation - Semana 2

## Manipulando dados

In [2]:
#importando os pacotes
import pandas as pd
import numpy as np

In [3]:
#acessando Help nos pacotes
pd?

## Dicionários

In [4]:
#criando um dicionário com os dados
dados = {'canal_venda':['facebool', 'instagram', 'linkedin', 'twitter'],
        'acessos':[100, 200, 300, 400],
        'site':[ 'site1', 'site1', 'site2', 'site2','site3'],
        'vendas':[1000.52, 1052.34, 2002, 5000, 300]}

In [5]:
#printar dicionário
dados

{'canal_venda': ['facebool', 'instagram', 'linkedin', 'twitter'],
 'acessos': [100, 200, 300, 400],
 'site': ['site1', 'site1', 'site2', 'site2', 'site3'],
 'vendas': [1000.52, 1052.34, 2002, 5000, 300]}

In [6]:
#verificando o tipo do dicionário
type(dados)

dict

In [7]:
#Acessando as chaves do dicionário
dados.keys()

dict_keys(['canal_venda', 'acessos', 'site', 'vendas'])

In [8]:
#acessando uma chave específica
dados['site']

['site1', 'site1', 'site2', 'site2', 'site3']

In [9]:
#Acessando posição específica
dados['canal_venda'][2]

'linkedin'

In [10]:
dados['canal_venda'][:3]

['facebool', 'instagram', 'linkedin']

## Listas

In [11]:
type([1,2,3])

list

In [12]:
#ciando uma lista
lista = [200,200,200,300,800]

In [13]:
#imprimindo a lista
lista

[200, 200, 200, 300, 800]

In [14]:
#vendo valores específicos
lista[1]

200

In [15]:
#fatia da lista
lista[:3]

[200, 200, 200]

In [16]:
#Adicionando a lista ao dicionário
dados['lista'] = lista

In [17]:
dados

{'canal_venda': ['facebool', 'instagram', 'linkedin', 'twitter'],
 'acessos': [100, 200, 300, 400],
 'site': ['site1', 'site1', 'site2', 'site2', 'site3'],
 'vendas': [1000.52, 1052.34, 2002, 5000, 300],
 'lista': [200, 200, 200, 300, 800]}

## Dataframes

In [18]:
dados

{'canal_venda': ['facebool', 'instagram', 'linkedin', 'twitter'],
 'acessos': [100, 200, 300, 400],
 'site': ['site1', 'site1', 'site2', 'site2', 'site3'],
 'vendas': [1000.52, 1052.34, 2002, 5000, 300],
 'lista': [200, 200, 200, 300, 800]}

In [19]:
#Criar um dataframe a partir de um dicionáio
dataframe = pd.DataFrame(dict([ (k,pd.Series(v)) for k,v in dados.items() ]))

In [20]:
#acessando o data frame
dataframe

  canal_venda  acessos   site   vendas  lista
0    facebool    100.0  site1  1000.52    200
1   instagram    200.0  site1  1052.34    200
2    linkedin    300.0  site2  2002.00    200
3     twitter    400.0  site2  5000.00    300
4         NaN      NaN  site3   300.00    800

In [21]:
#printando as primeiras linhas do df
dataframe.head(2)

  canal_venda  acessos   site   vendas  lista
0    facebool    100.0  site1  1000.52    200
1   instagram    200.0  site1  1052.34    200

In [22]:
# verificando o formado do df
dataframe.shape

(5, 5)

In [23]:
type(dataframe)

pandas.core.frame.DataFrame

In [24]:
#verificando o indice do df
dataframe.index

RangeIndex(start=0, stop=5, step=1)

In [25]:
#verificando os tipos dos dados do df
dataframe.dtypes

canal_venda     object
acessos        float64
site            object
vendas         float64
lista            int64
dtype: object

In [26]:
#verificando se existe valores faltantes
dataframe.isna()

   canal_venda  acessos   site  vendas  lista
0        False    False  False   False  False
1        False    False  False   False  False
2        False    False  False   False  False
3        False    False  False   False  False
4         True     True  False   False  False

In [27]:
#printando os nomes das colunas
dataframe.columns

Index(['canal_venda', 'acessos', 'site', 'vendas', 'lista'], dtype='object')

In [28]:
#acessando uma coluna específica
dataframe['canal_venda']

0     facebool
1    instagram
2     linkedin
3      twitter
4          NaN
Name: canal_venda, dtype: object

In [29]:
#criando uma nova coluna
dataframe['nova_coluna'] = [1,2,3,4,5]

In [30]:
dataframe

  canal_venda  acessos   site   vendas  lista  nova_coluna
0    facebool    100.0  site1  1000.52    200            1
1   instagram    200.0  site1  1052.34    200            2
2    linkedin    300.0  site2  2002.00    200            3
3     twitter    400.0  site2  5000.00    300            4
4         NaN      NaN  site3   300.00    800            5

In [31]:
dataframe.columns

Index(['canal_venda', 'acessos', 'site', 'vendas', 'lista', 'nova_coluna'], dtype='object')

In [32]:
#removendo colunas
dataframe.drop(columns = ['acessos', 'site', 'canal_venda'])

    vendas  lista  nova_coluna
0  1000.52    200            1
1  1052.34    200            2
2  2002.00    200            3
3  5000.00    300            4
4   300.00    800            5

In [33]:
dataframe

  canal_venda  acessos   site   vendas  lista  nova_coluna
0    facebool    100.0  site1  1000.52    200            1
1   instagram    200.0  site1  1052.34    200            2
2    linkedin    300.0  site2  2002.00    200            3
3     twitter    400.0  site2  5000.00    300            4
4         NaN      NaN  site3   300.00    800            5

In [34]:
#Mostrando as colunas
dataframe.columns

Index(['canal_venda', 'acessos', 'site', 'vendas', 'lista', 'nova_coluna'], dtype='object')

In [35]:
#Acessando valores específicos
dataframe['acessos'][1]

200.0

In [36]:
#Acessando fatia de coluna específica
dataframe['canal_venda'][:2]

0     facebool
1    instagram
Name: canal_venda, dtype: object

In [37]:
dataframe

  canal_venda  acessos   site   vendas  lista  nova_coluna
0    facebool    100.0  site1  1000.52    200            1
1   instagram    200.0  site1  1052.34    200            2
2    linkedin    300.0  site2  2002.00    200            3
3     twitter    400.0  site2  5000.00    300            4
4         NaN      NaN  site3   300.00    800            5

In [38]:
#fatiando os dados usando iloc
dataframe.iloc[3:,4:]

   lista  nova_coluna
3    300            4
4    800            5

In [39]:
dataframe

  canal_venda  acessos   site   vendas  lista  nova_coluna
0    facebool    100.0  site1  1000.52    200            1
1   instagram    200.0  site1  1052.34    200            2
2    linkedin    300.0  site2  2002.00    200            3
3     twitter    400.0  site2  5000.00    300            4
4         NaN      NaN  site3   300.00    800            5

In [40]:
#Fatiar df utilizando loc(indice)
dataframe.loc[:3]

  canal_venda  acessos   site   vendas  lista  nova_coluna
0    facebool    100.0  site1  1000.52    200            1
1   instagram    200.0  site1  1052.34    200            2
2    linkedin    300.0  site2  2002.00    200            3
3     twitter    400.0  site2  5000.00    300            4

In [41]:
#Selecionando colunas específicas
dataframe[['canal_venda', 'vendas']]

  canal_venda   vendas
0    facebool  1000.52
1   instagram  1052.34
2    linkedin  2002.00
3     twitter  5000.00
4         NaN   300.00

In [42]:
#Passando os valores através de lista
filtro = ['canal_venda', 'acessos']

In [43]:
dataframe[filtro]

  canal_venda  acessos
0    facebool    100.0
1   instagram    200.0
2    linkedin    300.0
3     twitter    400.0
4         NaN      NaN

In [44]:
#Usando o método info
dataframe.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 6 columns):
canal_venda    4 non-null object
acessos        4 non-null float64
site           5 non-null object
vendas         5 non-null float64
lista          5 non-null int64
nova_coluna    5 non-null int64
dtypes: float64(2), int64(2), object(2)
memory usage: 320.0+ bytes

In [45]:
dataframe

  canal_venda  acessos   site   vendas  lista  nova_coluna
0    facebool    100.0  site1  1000.52    200            1
1   instagram    200.0  site1  1052.34    200            2
2    linkedin    300.0  site2  2002.00    200            3
3     twitter    400.0  site2  5000.00    300            4
4         NaN      NaN  site3   300.00    800            5

In [46]:
#Pivotando os dados
aux = dataframe.pivot(index = 'canal_venda', columns= 'site', values='acessos')

In [47]:
aux.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, nan to twitter
Data columns (total 3 columns):
site1    2 non-null float64
site2    2 non-null float64
site3    0 non-null float64
dtypes: float64(3)
memory usage: 160.0+ bytes

In [48]:
#Completando os valores faltantes usando fillna
#Pivotando os dados (coluna)
aux = dataframe.pivot(index = 'canal_venda', columns = 'site', values = 'acessos').fillna(0)
dataframe.pivot(index = 'canal_venda', columns = 'site', values = 'acessos').fillna(0)

site         site1  site2  site3
canal_venda
NaN            0.0    0.0    0.0
facebool     100.0    0.0    0.0
instagram    200.0    0.0    0.0
linkedin       0.0  300.0    0.0
twitter        0.0  400.0    0.0

In [49]:
dataframe

  canal_venda  acessos   site   vendas  lista  nova_coluna
0    facebool    100.0  site1  1000.52    200            1
1   instagram    200.0  site1  1052.34    200            2
2    linkedin    300.0  site2  2002.00    200            3
3     twitter    400.0  site2  5000.00    300            4
4         NaN      NaN  site3   300.00    800            5

In [53]:
#mudando as colunas usando o comando melt
dataframe.melt(id_vars='site',value_vars=['canal_venda'])

    site     variable      value
0  site1  canal_venda   facebool
1  site1  canal_venda  instagram
2  site2  canal_venda   linkedin
3  site2  canal_venda    twitter
4  site3  canal_venda        NaN

In [54]:
#resetando o indice do dataframe
print(aux.columns)
aux = dataframe.reset_index()
print(aux.columns)

Index(['site1', 'site2', 'site3'], dtype='object', name='site')
Index(['index', 'canal_venda', 'acessos', 'site', 'vendas', 'lista',
       'nova_coluna'],
      dtype='object')

In [55]:
dataframe

  canal_venda  acessos   site   vendas  lista  nova_coluna
0    facebool    100.0  site1  1000.52    200            1
1   instagram    200.0  site1  1052.34    200            2
2    linkedin    300.0  site2  2002.00    200            3
3     twitter    400.0  site2  5000.00    300            4
4         NaN      NaN  site3   300.00    800            5

In [56]:
aux.reset_index()

   level_0  index canal_venda  acessos   site   vendas  lista  nova_coluna
0        0      0    facebool    100.0  site1  1000.52    200            1
1        1      1   instagram    200.0  site1  1052.34    200            2
2        2      2    linkedin    300.0  site2  2002.00    200            3
3        3      3     twitter    400.0  site2  5000.00    300            4
4        4      4         NaN      NaN  site3   300.00    800            5

In [57]:
aux

   index canal_venda  acessos   site   vendas  lista  nova_coluna
0      0    facebool    100.0  site1  1000.52    200            1
1      1   instagram    200.0  site1  1052.34    200            2
2      2    linkedin    300.0  site2  2002.00    200            3
3      3     twitter    400.0  site2  5000.00    300            4
4      4         NaN      NaN  site3   300.00    800            5

In [62]:
#Exemplo do comando melt
aux.melt(id_vars='canal_venda', value_vars=['vendas'])

  canal_venda variable    value
0    facebool   vendas  1000.52
1   instagram   vendas  1052.34
2    linkedin   vendas  2002.00
3     twitter   vendas  5000.00
4         NaN   vendas   300.00

In [61]:
dataframe

  canal_venda  acessos   site   vendas  lista  nova_coluna
0    facebool    100.0  site1  1000.52    200            1
1   instagram    200.0  site1  1052.34    200            2
2    linkedin    300.0  site2  2002.00    200            3
3     twitter    400.0  site2  5000.00    300            4
4         NaN      NaN  site3   300.00    800            5

In [63]:
#Somando as linhas do df
dataframe.sum(axis = 1)

0    1301.52
1    1454.34
2    2505.00
3    5704.00
4    1105.00
dtype: float64

In [64]:
#calculando a mediana das colunas numéricas
print('Por linha: ', dataframe.median(axis=1))
print('Por coluna: ', dataframe.median())

Por linha:  0    150.0
1    200.0
2    250.0
3    350.0
4    300.0
dtype: float64
Por coluna:  acessos         250.00
vendas         1052.34
lista           200.00
nova_coluna       3.00
dtype: float64

In [65]:
#Calculando a média das colunas numéricas
dataframe.mean()

acessos         250.000
vendas         1870.972
lista           340.000
nova_coluna       3.000
dtype: float64

In [66]:
#Calculando o desvio padrão 
dataframe.std()

acessos         129.099445
vendas         1850.931024
lista           260.768096
nova_coluna       1.581139
dtype: float64

In [67]:
#Usando o comando describe que calcula estatisticas descritivas para colunas numericas
dataframe.describe()

          acessos       vendas       lista  nova_coluna
count    4.000000     5.000000    5.000000     5.000000
mean   250.000000  1870.972000  340.000000     3.000000
std    129.099445  1850.931024  260.768096     1.581139
min    100.000000   300.000000  200.000000     1.000000
25%    175.000000  1000.520000  200.000000     2.000000
50%    250.000000  1052.340000  200.000000     3.000000
75%    325.000000  2002.000000  300.000000     4.000000
max    400.000000  5000.000000  800.000000     5.000000

In [68]:
#calculando a moda
dataframe.mode()

  canal_venda  acessos   site   vendas  lista  nova_coluna
0    facebool    100.0  site1   300.00  200.0            1
1   instagram    200.0  site2  1000.52    NaN            2
2    linkedin    300.0    NaN  1052.34    NaN            3
3     twitter    400.0    NaN  2002.00    NaN            4
4         NaN      NaN    NaN  5000.00    NaN            5

In [69]:
# Valor máximo por coluna
dataframe.max()

acessos         400.0
vendas         5000.0
lista           800.0
nova_coluna       5.0
dtype: float64

In [70]:
#valor minimo por coluna
dataframe.min()

acessos        100.0
vendas         300.0
lista          200.0
nova_coluna      1.0
dtype: float64

In [71]:
#printando o número de unicos
dataframe.nunique()

canal_venda    4
acessos        4
site           3
vendas         5
lista          3
nova_coluna    5
dtype: int64

In [72]:
#Contando valores únicos de uma coluna
dataframe['canal_venda'].value_counts()

twitter      1
linkedin     1
facebool     1
instagram    1
Name: canal_venda, dtype: int64

In [74]:
#Valores unicos de uma coluna
dataframe['canal_venda'].unique()

array(['facebool', 'instagram', 'linkedin', 'twitter', nan], dtype=object)

In [75]:
# Usando o groupby com valores numericos
dataframe.groupby('canal_venda')['acessos'].median()

canal_venda
facebool     100.0
instagram    200.0
linkedin     300.0
twitter      400.0
Name: acessos, dtype: float64

In [78]:
dataframe.groupby('canal_venda')['acessos'].unique()

canal_venda
facebool     [100.0]
instagram    [200.0]
linkedin     [300.0]
twitter      [400.0]
Name: acessos, dtype: object

In [79]:
dataframe.groupby('canal_venda')['acessos'].sum()

canal_venda
facebool     100.0
instagram    200.0
linkedin     300.0
twitter      400.0
Name: acessos, dtype: float64

In [80]:
# Usando group by com valores categoricos
dataframe.groupby('site')['canal_venda'].unique()

site
site1    [facebool, instagram]
site2      [linkedin, twitter]
site3                    [nan]
Name: canal_venda, dtype: object

In [81]:
dataframe.groupby('site')['canal_venda'].first()

site
site1    facebool
site2    linkedin
site3         NaN
Name: canal_venda, dtype: object

In [82]:
#Usando o groupby com a função agg
dataframe.groupby('canal_venda').agg({'site': 'unique','acessos': 'sum'})

                site  acessos
canal_venda
facebool     [site1]    100.0
instagram    [site1]    200.0
linkedin     [site2]    300.0
twitter      [site2]    400.0

In [84]:
#Correlações entre variáveis
dataframe.corr()

              acessos    vendas     lista  nova_coluna
acessos      1.000000  0.888490  0.774597     1.000000
vendas       0.888490  1.000000 -0.326149     0.217542
lista        0.774597 -0.326149  1.000000     0.788241
nova_coluna  1.000000  0.217542  0.788241     1.000000

In [85]:
dataframe

  canal_venda  acessos   site   vendas  lista  nova_coluna
0    facebool    100.0  site1  1000.52    200            1
1   instagram    200.0  site1  1052.34    200            2
2    linkedin    300.0  site2  2002.00    200            3
3     twitter    400.0  site2  5000.00    300            4
4         NaN      NaN  site3   300.00    800            5

In [86]:
# Criando variavel categorica por fatia de variavel numérica
dataframe['categoria_vendas'] = pd.cut(dataframe['vendas'],
                                      bins = (0, 1500, 2000, 8000), labels = ('0 a 1500','1500 a 2000', '2000 a 8000'))

In [87]:
dataframe

  canal_venda  acessos   site   vendas  lista  nova_coluna categoria_vendas
0    facebool    100.0  site1  1000.52    200            1         0 a 1500
1   instagram    200.0  site1  1052.34    200            2         0 a 1500
2    linkedin    300.0  site2  2002.00    200            3      2000 a 8000
3     twitter    400.0  site2  5000.00    300            4      2000 a 8000
4         NaN      NaN  site3   300.00    800            5         0 a 1500

In [88]:
#Criando variavel categorica usando compressão de lista
dataframe['categoria_acessos'] = ['maior_que_300' if x > 300 else 'menor_que_300' for x in dataframe['acessos']]

In [90]:
dataframe

,canal_venda,acessos,site,vendas,lista,nova_coluna,categoria_vendas,categoria_acessos
0,facebool,100.0,site1,1000.52,200,1,0 a 1500,menor_que_300
1,instagram,200.0,site1,1052.34,200,2,0 a 1500,menor_que_300
2,linkedin,300.0,site2,2002.00,200,3,2000 a 8000,menor_que_300
3,twitter,400.0,site2,5000.00,300,4,2000 a 8000,maior_que_300
4,NaN,NaN,site3,300.00,800,5,0 a 1500,menor_que_300

In [91]:
#Juntando 2 dataframes / criando o 2 df
dataframe_2 = pd.DataFrame({'site': ['site1', 'site1', 'site2', 'site2', 'site3'],
                           'suporte': ["Carlos", 'Carlos', 'Maria', 'Maria', 'Ezequiel']})

In [92]:
# Realizando o merge
dataframe.merge(dataframe_2, on= 'site', how='left')

,canal_venda,acessos,site,vendas,lista,nova_coluna,categoria_vendas,categoria_acessos,suporte
0,facebool,100.0,site1,1000.52,200,1,0 a 1500,menor_que_300,Carlos
1,facebool,100.0,site1,1000.52,200,1,0 a 1500,menor_que_300,Carlos
2,instagram,200.0,site1,1052.34,200,2,0 a 1500,menor_que_300,Carlos
3,instagram,200.0,site1,1052.34,200,2,0 a 1500,menor_que_300,Carlos
4,linkedin,300.0,site2,2002.00,200,3,2000 a 8000,menor_que_300,Maria
5,linkedin,300.0,site2,2002.00,200,3,2000 a 8000,menor_que_300,Maria
6,twitter,400.0,site2,5000.00,300,4,2000 a 8000,maior_que_300,Maria
7,twitter,400.0,site2,5000.00,300,4,2000 a 8000,maior_que_300,Maria
8,NaN,NaN,site3,300.00,800,5,0 a 1500,menor_que_300,Ezequiel

In [93]:
# Salvando o df como csv
dataframe.to_csv('dataframe.csv', sep=';', decimal=',', index= False)

In [94]:
#Lendo os dados no formato csv
dataframe_lido = pd.read_csv('dataframe.csv', sep=';', decimal=',')

In [95]:
dataframe_lido.head()

,canal_venda,acessos,site,vendas,lista,nova_coluna,categoria_vendas,categoria_acessos
0,facebool,100.0,site1,1000.52,200,1,0 a 1500,menor_que_300
1,instagram,200.0,site1,1052.34,200,2,0 a 1500,menor_que_300
2,linkedin,300.0,site2,2002.00,200,3,2000 a 8000,menor_que_300
3,twitter,400.0,site2,5000.00,300,4,2000 a 8000,maior_que_300
4,NaN,NaN,site3,300.00,800,5,0 a 1500,menor_que_300